clear; clc;

T = readcell("数据\附件2：调查数据.xlsx", 'Range', 'B1:AE4606');
dt = T;

%单选题处理
s = {
    '男', '女', '0', '0', '0', '0';
    '文法类', '理工类', '经管类', '艺术教育类', '0', '0';
    '大一', '大二', '大三', '大四', '0', '0';
    '安静型', '外向型', '温顺型', '坚定型', '感性型', '其他';
    '在寝室用笔记本上网', '用手机上网', '用平板电脑上网', '在网吧上', '其他', '0';
    '7小时以下', '7-14小时', '14-20小时', '20小时以上',  '不上网', '0';

    %7~10
    '是', '否', '0', '0', '0', '0';
    '平时有时间就使用', '考试前使用', '老师要求时才使用', '说不清', '0', '0';
    '完全会', '大多数时候会', '有时会', '很少会', '不会', '0';
    '是', '否', '0', '0', '0', '0';
    '推荐过', '没有', '0', '0', '0', '0';

    %12~15
    '是', '否', '0', '0', '0', '0';
    '是', '否', '没考虑过', '0', '0', '0';
    '是', '否', '没考虑过', '0', '0', '0';
    '是', '否', '没考虑过', '0', '0', '0';

    %16~22
    '信息杂乱', '应用繁琐', '资源收费', '其他', '0', '0';
    '赞同', '不赞同', '说不清楚', '0', '0', '0';
    '软件响应慢', '所答问题不精炼', '无效回答', '0', '0', '0';
    '很高', '一般', '不相信', '0', '0', '0';
    '全面提高自身的综合素质', '仅帮助自己解决不会的题', '应付考试', '完成论文', '0', '0';
    '非常可能', '有可能', '不可能', '不清楚', '0', '0';
    '积极利用新的学习方式和工具', '被动接受新的学习模式', '固定传统，不接受新的学习方式', '完全依赖人工智能工具', '0', '0';
    };

% [~, n] = size(s);
n = [2, 4, 4, 6, 5, 5,   2, 4, 5, 2,   2, 2, 3, 3, 3,   4, 3, 3, 3, 4, 4, 4];

for i = 2:4606
    for j = 1:22
        %     for j = 1:17
        %         if j == 11
        %             dt(i, j) = num2cell(1);
        %             continue;
        %         end
        if j <= 6
            for k = 1:6
                if isequal(dt(i, j), s(j, k))
                    dt(i, j) = num2cell(k);
                end
            end
        else
            for k = 1:n(1, j)
                if isequal(dt(i, j), s(j, k))
                    dt(i, j) = num2cell(n(1, j) - k + 1);
                end
            end
        end
    end
end

%多选题处理
st = {'学习、查资料', '浏览新闻', '收发邮件', '娱乐游戏', '聊天交友', '资源下载', '上网购物', '其他';
    '真题全面', '可以重复学习', '资料全面', '0', '0', '0', '0', '0';
    '学习的相关经验缺乏', '专业疑难问题得不到解决', '学习时间安排不充裕', '不会正确的学习方法', '0', '0', '0', '0';
    %26~30
    '学习效果', '学习资源', '操作方便', '学习费用', '0', '0', '0', '0';
    '软件安全级别', '网络安全能力', '个人信息安全', '数据安全', '运行安全', '服务器安全', '0', '0';
    '知识来源的资格审核', '知识库的更新频率', '是否有定期的审核', '0', '0', '0', '0', '0';
    '性能优越', '知识面广', '运行速度快', '稳定', '不收费', '0', '0', '0';
    '教师传授', '课后消化', '评价反馈', '其他', '0', '0', '0', '0';
    };

cc = dt;
[mt, ~] = size(st);
nt = [8, 3, 4, 4, 6, 3, 5, 4];
for i = 2:4606
%     for j = 18:25
    for j = 23:30
        x = zeros(1, nt(1, j - 22), 1);
        for k = 1:nt(1, j - 22)
            if contains(dt(i, j), st(j - 22, k))
                x(1, k) = 1;
            end
        end
        dt(i, j) = num2cell(sum(x));
    end
end

writecell(dt, '数据\分值化的数据.xlsx');